[
  {
    "action": "Accept",
    "original": "←\nBook 1\nThe Gates of Morning/Book 1\nby Henry De Vere Stacpoole\nBook 1. Chapter 3\nChapter 2\n→\n​\n\nCHAPTER III\n\nTHE LITTLE SHIPS\n\nT\nHE primitive canoe of the Pacific is a dugout—the trunk of a tree hollowed and shaped into the form of a boat, so narrow in proportion to its length as to be absolutely unstable but for the outrigger.\n\nThe outrigger, a long skate-shaped piece of wood fixed to port—always to port—by poles on a central bridge, is an apology to the sea for want of beam, and the sea accepts it—on conditions. But for the outrigger, no canoe of any size would dare the sea, but for it the islands would have been sealed as between themselves, war made impossible, and the drift of people between island and island and between island and continent.\n\nFar away in the remote past some man once stood, the father of this daring invention; little dreaming of the vast consequences of the work to which he had put his hand.\n\nDick at the steering paddle saw a figure on the northern beach as they drew near. It was Katafa, waiting for him, the wind blowing her girdle of dracæna leaves and her hand sheltering her eyes against the sun. Standing just as Le Moan was standing on the southern beach sheltering her eyes and ​watching the canoe that carried the first man who had ever made her turn her head.\n\nSome children were playing near Katafa and a fishing canoe was putting out near by, but he saw only Katafa.\n\n“Katafa,” said Aioma, who was crouched by the after outrigger pole. “It is she sure enough, and they said she was dead and that her ghost had returned bringing you with her, Taori, but the dead do not return. Katafa, she was the girl under the taboo of Taminan, the girl no man or woman might touch, and then one day she went fishing beyond the reef and a storm took her and she was drowned, so they said.”\n\n“She was not drowned,” replied Dick. “The wind blew her to Marua where I was—I and another whose face I have near forgotten, Kearney, he was called, and he made canoes but not like these, then one day he went among the trees and did not return. Then the god Nan came to the island and after him the men of Karolin who fought together so that all were killed, and then came the bad men as I have told you and would have killed us but we left Marua in the night.... Look, there is the canoe we came in.” He pointed to the dinghy hauled up on the beach.\n\n“O he! Taori!” It was Katafa’s voice hailing them from the shore, glad, sweet, clear as a bell, yet far-carrying as the voice of a gull.\n\nAs Dick sprang out on the sands he seized her in ​his arms; parted only a few hours, it seemed to them that they had been weeks apart.\n\nIn the old days, even before he was born, his mother Emmeline had never been at ease when separated from his father even by the breadth of the lagoon, the demon that hints of mischance seemed always at her ear.\n\nDick seemed to have inherited with his power of love for Katafa, something of the dread of mischance for the beloved.\n\nHe embraced her, heedless of onlookers, though the only eyes to see were the eyes of the children and of Aioma who had eyes for nothing but the dinghy.\n\nAs soon as his foot touched sand, the canoe-builder made for it running like a boy, clapped his hand on the gunnel and then ran it over the planking.\n\nThe boats of the Spanish ship of long ago had been clinker-built and had been destroyed in the fight, but he had seen bits of them washed ashore on the southern beach. The dinghy was carvel-built and entire, a perfect specimen of eastern boat-building over which the canoe designer brooded forgetful of Dick and Katafa, the beach he stood on and the sun that lit it.\n\nThe idea of a boat built of planking and not hollowed out of a tree trunk had been presented to him by the charred and shattered fragments of the Spanish boats, but how to get planking and how to bend it to the form he desired was beyond his imagination and beyond his means. He saw vaguely that these boats ​of the papalagi were made somewhat after the fashion of a man, with a backbone and ribs and a covering for the ribs, he saw that by this means enough beam could be obtained to enable the builder to dispense with the outrigger—but then speed, where was there sign of speed in this thing squat and ugly?\n\nIn the early ages of the world in which Aioma still dwelt, ugliness had only two expressions, the lines that indicated want of speed and the lines that indicated want of strength.\n\nDick, though brown as the canoe-builder and almost to be mistaken for a true islander, was perhaps a million years younger than Aioma, just as the dinghy was a million years younger than the fishing canoe that had just brought him across the lagoon. In Dick, Aioma saw the lines that indicated speed and strength, nothing more—he was blind to the nobility of type expressed by that daring face, to the far sight of the eyes and the breadth of the brow; in the dinghy Aioma saw want of speed—he was blind to the nobility of type that made this bud the sister of a battleship, made it a vertebrate as against the dugout which has neither keel nor ribs.\n\nThen Aioma, standing in the sun, a plain canoe-builder and workman in the sight of God and a critic as every true workman is, began to deride the dinghy, at first with chuckles deep down in his throat, then with a sound like the clacking of a hen, then with laughter long and loud and words of derision.\n\n​“Which end is which of this pig fish?” inquired Aioma of heaven and Dick, “and he who made her, how many more did he make like her?”\n\nDick, who had always connected the dinghy with Kearney, and who had a sort of faith that Kearney had made her just as he had made the little model ships, winced at the laughter of the old man. Perhaps it was the white man in him revolting at the derision of a savage over the works of the white man. However that may be, he turned and ran up the beach to the house of Uta Matu which he and Katafa had made their own. There in the shadow, on a hastily constructed shelf stood the little model ships he had so carefully salved from Palm Tree: the frigate, the schooner, the full-rigged ship and the whale man, the last thread connecting him with civilization; toys of the long ago, but no longer toys—fetiches from a world whose very language he had lost, a world of sun and tall trees where like a ghost in the sun dazzle moved a memory that was once a man—Kearney.\n\nHe took the schooner from its rest and coming out with it, ran to a great pool in the coral, calling Aioma to come and see what he who made the dinghy had also made.\n\nThe pool thirty feet long by twenty broad was ruffled by the breeze from the sea, it was clear as crystal, coral floored—and a trapped school of tiny fish no larger than needles, passed like a silver cloud here and there. Dick on his knees launched the schooner and Aioma standing bent with a hand on each knee ​watched her as she floated on an even keel. Then on the merry west wind with helm properly set and main boom guyed out she went sailing down the pool to the east where Katafa had run to receive her.\n\nAioma watched, then Dick running to the other end showed him how she could sail almost against the wind. Dick knew every stick and string of her, how to hoist and lower main and fore and how to set the head sails,—had you placed him on a real schooner, he could have worked her from his knowledge of the model, and Aioma watched vastly intrigued; then, taking a hand, he got on his knees and the great sun saw the builders of the future fleet of Karolin playing like children, whilst the little schooner on its imitation sea sailed from port to port, bowing to the ripples of the pool as the lost Raratonga, of which it was the model, had bowed to the swell of the great Pacific.\n\nBook 1\nReturn to the top of the page.\nChapter 2",
    "final_text": "### Chapter 3: The Little Ships\n\nThe traditional canoe of the Pacific is a dugout—a tree trunk hollowed out and shaped into a boat. These canoes are narrow and unstable, but they're stabilized by an outrigger. The outrigger is a long, skate-shaped piece of wood attached to the side of the canoe by poles on a central bridge. It's a necessary addition to keep the canoe from tipping over in the sea. Without the outrigger, these canoes wouldn't be seaworthy, and the islands would be isolated, making travel and communication between them nearly impossible.\n\nCenturies ago, someone invented the outrigger, likely never imagining the profound impact it would have on island life. It enabled people to navigate the seas, connecting islands and continents, and even facilitating trade and warfare.\n\nAs Dick steered the canoe towards the northern beach, he spotted a figure waiting for him. It was Katafa, her hair blowing in the wind and her hand shielding her eyes from the sun. She stood just as Le Moan did on the southern beach, watching the canoe approach. Children played nearby, and a fishing canoe was setting out to sea, but Dick's eyes were fixed on Katafa.\n\n“Katafa,” Aioma, crouched by the after outrigger pole, said. “It’s her, just as they said. They thought she was dead and that her ghost had returned with you, Taori. But the dead don’t come back. Katafa was under the taboo of Taminan, untouchable by anyone. Then one day, she went fishing beyond the reef and was swept away by a storm. They said she drowned.”\n\n“She didn’t drown,” Dick replied. “The wind blew her to Marua, where I was. I was with Kearney, who built canoes differently. One day, he went into the forest and never returned. Then the god Nan came to the island, followed by the Karolin men who fought and were all killed. After that, bad men arrived and would have killed us, but we escaped Marua in the night. Look, there’s the dinghy we came in.”\n\nDick pointed to the small boat hauled up on the beach. As soon as his feet touched the sand, he ran to Katafa and embraced her. They had been apart for only a few hours, but it felt like weeks.\n\nDick’s mother, Emmeline, had always been anxious when separated from his father, even by the width of a lagoon. Dick seemed to inherit that anxiety, feeling a deep dread of anything that might harm Katafa.\n\nAioma, the canoe-builder, immediately headed towards the dinghy, running like a boy. He ran his hand over the planking, marveling at the craftsmanship. The dinghy was carvel-built, with planks laid edge to edge, unlike the clinker-built boats of the Spanish ship that had been destroyed in a fight. The dinghy was a perfect example of eastern boat-building, and Aioma was captivated by it, forgetting everything else around him.\n\nThe idea of a boat built from planks rather than a hollowed-out tree trunk had been sparked by the remnants of the Spanish boats. However, Aioma couldn’t figure out how to get the planks or bend them into the shape he wanted. He saw that these boats had a backbone and ribs, covered by planks, which gave them enough stability to do without an outrigger. But he wondered about speed—these boats seemed slow and clumsy.\n\nAioma, standing in the sun, began to mock the dinghy. He chuckled at first, then laughed loudly, deriding its design. “Which end is which on this pig fish?” he joked. “And how many more like it did the maker build?”\n\nDick, who had always associated the dinghy with Kearney, felt a pang of anger at Aioma’s laughter. Perhaps it was the white man in him, revolting against the ridicule of a “savage” over the work of a white man. He turned and ran up the beach to the house he shared with Katafa. There, on a hastily built shelf, stood the little model ships he had rescued from Palm Tree: a frigate, a schooner, a full-rigged ship, and a whaler. These models were his last connection to civilization, toys from a distant past that now held a deeper significance.\n\nHe took the schooner model and ran to a large pool in the coral. The pool was clear and filled with tiny fish darting about. Dick launched the schooner, and Aioma watched as it floated smoothly. Dick demonstrated how the model could sail almost against the wind, showing off his deep knowledge of sailing. Aioma was fascinated, and soon they were both on their knees, playing with the model schooner in the pool. The little boat sailed from one end to the other, bowing to the ripples as if it were a real ship on the open sea.\n\nIn that moment, under the sun, the builders of Karolin’s future fleet played like children, their eyes filled with wonder and excitement. The little schooner, a model of the lost Raratonga, sailed gracefully in its miniature sea, a symbol of the vast possibilities that lay ahead.",
    "comments": "Accepted as is.",
    "review_score": 44,
    "rl_reward": 0.808,
    "total_reward": 0.8440000000000001
  },
  {
    "action": "Accept",
    "original": "←\nBook 1\nThe Gates of Morning/Book 1\nby Henry De Vere Stacpoole\nBook 1. Chapter 3\nChapter 2\n→\n​\n\nCHAPTER III\n\nTHE LITTLE SHIPS\n\nT\nHE primitive canoe of the Pacific is a dugout—the trunk of a tree hollowed and shaped into the form of a boat, so narrow in proportion to its length as to be absolutely unstable but for the outrigger.\n\nThe outrigger, a long skate-shaped piece of wood fixed to port—always to port—by poles on a central bridge, is an apology to the sea for want of beam, and the sea accepts it—on conditions. But for the outrigger, no canoe of any size would dare the sea, but for it the islands would have been sealed as between themselves, war made impossible, and the drift of people between island and island and between island and continent.\n\nFar away in the remote past some man once stood, the father of this daring invention; little dreaming of the vast consequences of the work to which he had put his hand.\n\nDick at the steering paddle saw a figure on the northern beach as they drew near. It was Katafa, waiting for him, the wind blowing her girdle of dracæna leaves and her hand sheltering her eyes against the sun. Standing just as Le Moan was standing on the southern beach sheltering her eyes and ​watching the canoe that carried the first man who had ever made her turn her head.\n\nSome children were playing near Katafa and a fishing canoe was putting out near by, but he saw only Katafa.\n\n“Katafa,” said Aioma, who was crouched by the after outrigger pole. “It is she sure enough, and they said she was dead and that her ghost had returned bringing you with her, Taori, but the dead do not return. Katafa, she was the girl under the taboo of Taminan, the girl no man or woman might touch, and then one day she went fishing beyond the reef and a storm took her and she was drowned, so they said.”\n\n“She was not drowned,” replied Dick. “The wind blew her to Marua where I was—I and another whose face I have near forgotten, Kearney, he was called, and he made canoes but not like these, then one day he went among the trees and did not return. Then the god Nan came to the island and after him the men of Karolin who fought together so that all were killed, and then came the bad men as I have told you and would have killed us but we left Marua in the night.... Look, there is the canoe we came in.” He pointed to the dinghy hauled up on the beach.\n\n“O he! Taori!” It was Katafa’s voice hailing them from the shore, glad, sweet, clear as a bell, yet far-carrying as the voice of a gull.\n\nAs Dick sprang out on the sands he seized her in ​his arms; parted only a few hours, it seemed to them that they had been weeks apart.\n\nIn the old days, even before he was born, his mother Emmeline had never been at ease when separated from his father even by the breadth of the lagoon, the demon that hints of mischance seemed always at her ear.\n\nDick seemed to have inherited with his power of love for Katafa, something of the dread of mischance for the beloved.\n\nHe embraced her, heedless of onlookers, though the only eyes to see were the eyes of the children and of Aioma who had eyes for nothing but the dinghy.\n\nAs soon as his foot touched sand, the canoe-builder made for it running like a boy, clapped his hand on the gunnel and then ran it over the planking.\n\nThe boats of the Spanish ship of long ago had been clinker-built and had been destroyed in the fight, but he had seen bits of them washed ashore on the southern beach. The dinghy was carvel-built and entire, a perfect specimen of eastern boat-building over which the canoe designer brooded forgetful of Dick and Katafa, the beach he stood on and the sun that lit it.\n\nThe idea of a boat built of planking and not hollowed out of a tree trunk had been presented to him by the charred and shattered fragments of the Spanish boats, but how to get planking and how to bend it to the form he desired was beyond his imagination and beyond his means. He saw vaguely that these boats ​of the papalagi were made somewhat after the fashion of a man, with a backbone and ribs and a covering for the ribs, he saw that by this means enough beam could be obtained to enable the builder to dispense with the outrigger—but then speed, where was there sign of speed in this thing squat and ugly?\n\nIn the early ages of the world in which Aioma still dwelt, ugliness had only two expressions, the lines that indicated want of speed and the lines that indicated want of strength.\n\nDick, though brown as the canoe-builder and almost to be mistaken for a true islander, was perhaps a million years younger than Aioma, just as the dinghy was a million years younger than the fishing canoe that had just brought him across the lagoon. In Dick, Aioma saw the lines that indicated speed and strength, nothing more—he was blind to the nobility of type expressed by that daring face, to the far sight of the eyes and the breadth of the brow; in the dinghy Aioma saw want of speed—he was blind to the nobility of type that made this bud the sister of a battleship, made it a vertebrate as against the dugout which has neither keel nor ribs.\n\nThen Aioma, standing in the sun, a plain canoe-builder and workman in the sight of God and a critic as every true workman is, began to deride the dinghy, at first with chuckles deep down in his throat, then with a sound like the clacking of a hen, then with laughter long and loud and words of derision.\n\n​“Which end is which of this pig fish?” inquired Aioma of heaven and Dick, “and he who made her, how many more did he make like her?”\n\nDick, who had always connected the dinghy with Kearney, and who had a sort of faith that Kearney had made her just as he had made the little model ships, winced at the laughter of the old man. Perhaps it was the white man in him revolting at the derision of a savage over the works of the white man. However that may be, he turned and ran up the beach to the house of Uta Matu which he and Katafa had made their own. There in the shadow, on a hastily constructed shelf stood the little model ships he had so carefully salved from Palm Tree: the frigate, the schooner, the full-rigged ship and the whale man, the last thread connecting him with civilization; toys of the long ago, but no longer toys—fetiches from a world whose very language he had lost, a world of sun and tall trees where like a ghost in the sun dazzle moved a memory that was once a man—Kearney.\n\nHe took the schooner from its rest and coming out with it, ran to a great pool in the coral, calling Aioma to come and see what he who made the dinghy had also made.\n\nThe pool thirty feet long by twenty broad was ruffled by the breeze from the sea, it was clear as crystal, coral floored—and a trapped school of tiny fish no larger than needles, passed like a silver cloud here and there. Dick on his knees launched the schooner and Aioma standing bent with a hand on each knee ​watched her as she floated on an even keel. Then on the merry west wind with helm properly set and main boom guyed out she went sailing down the pool to the east where Katafa had run to receive her.\n\nAioma watched, then Dick running to the other end showed him how she could sail almost against the wind. Dick knew every stick and string of her, how to hoist and lower main and fore and how to set the head sails,—had you placed him on a real schooner, he could have worked her from his knowledge of the model, and Aioma watched vastly intrigued; then, taking a hand, he got on his knees and the great sun saw the builders of the future fleet of Karolin playing like children, whilst the little schooner on its imitation sea sailed from port to port, bowing to the ripples of the pool as the lost Raratonga, of which it was the model, had bowed to the swell of the great Pacific.\n\nBook 1\nReturn to the top of the page.\nChapter 2",
    "final_text": "### Chapter 3: The Little Ships\n\nThe traditional canoe of the Pacific is a dugout—a tree trunk hollowed out and shaped into a boat. These canoes are narrow and unstable, but they're stabilized by an outrigger. The outrigger is a long, skate-shaped piece of wood attached to the side of the canoe by poles on a central bridge. It's a necessary addition to keep the canoe from tipping over in the sea. Without the outrigger, these canoes wouldn't be seaworthy, and the islands would be isolated, making travel and communication between them nearly impossible.\n\nCenturies ago, someone invented the outrigger, likely never imagining the profound impact it would have on island life. It enabled people to navigate the seas, connecting islands and continents, and even facilitating trade and warfare.\n\nAs Dick steered the canoe towards the northern beach, he spotted a figure waiting for him. It was Katafa, her hair blowing in the wind and her hand shielding her eyes from the sun. She stood just as Le Moan did on the southern beach, watching the canoe approach. Children played nearby, and a fishing canoe was setting out to sea, but Dick's eyes were fixed on Katafa.\n\n“Katafa,” Aioma, crouched by the after outrigger pole, said. “It’s her, just as they said. They thought she was dead and that her ghost had returned with you, Taori. But the dead don’t come back. Katafa was under the taboo of Taminan, untouchable by anyone. Then one day, she went fishing beyond the reef and was swept away by a storm. They said she drowned.”\n\n“She didn’t drown,” Dick replied. “The wind blew her to Marua, where I was. I was with Kearney, who built canoes differently. One day, he went into the forest and never returned. Then the god Nan came to the island, followed by the Karolin men who fought and were all killed. After that, bad men arrived and would have killed us, but we escaped Marua in the night. Look, there’s the dinghy we came in.”\n\nDick pointed to the small boat hauled up on the beach. As soon as his feet touched the sand, he ran to Katafa and embraced her. They had been apart for only a few hours, but it felt like weeks.\n\nDick’s mother, Emmeline, had always been anxious when separated from his father, even by the width of a lagoon. Dick seemed to inherit that anxiety, feeling a deep dread of anything that might harm Katafa.\n\nAioma, the canoe-builder, immediately headed towards the dinghy, running like a boy. He ran his hand over the planking, marveling at the craftsmanship. The dinghy was carvel-built, with planks laid edge to edge, unlike the clinker-built boats of the Spanish ship that had been destroyed in a fight. The dinghy was a perfect example of eastern boat-building, and Aioma was captivated by it, forgetting everything else around him.\n\nThe idea of a boat built from planks rather than a hollowed-out tree trunk had been sparked by the remnants of the Spanish boats. However, Aioma couldn’t figure out how to get the planks or bend them into the shape he wanted. He saw that these boats had a backbone and ribs, covered by planks, which gave them enough stability to do without an outrigger. But he wondered about speed—these boats seemed slow and clumsy.\n\nAioma, standing in the sun, began to mock the dinghy. He chuckled at first, then laughed loudly, deriding its design. “Which end is which on this pig fish?” he joked. “And how many more like it did the maker build?”\n\nDick, who had always associated the dinghy with Kearney, felt a pang of anger at Aioma’s laughter. Perhaps it was the white man in him, revolting against the ridicule of a “savage” over the work of a white man. He turned and ran up the beach to the house he shared with Katafa. There, on a hastily built shelf, stood the little model ships he had rescued from Palm Tree: a frigate, a schooner, a full-rigged ship, and a whaler. These models were his last connection to civilization, toys from a distant past that now held a deeper significance.\n\nHe took the schooner model and ran to a large pool in the coral. The pool was clear and filled with tiny fish darting about. Dick launched the schooner, and Aioma watched as it floated smoothly. Dick demonstrated how the model could sail almost against the wind, showing off his deep knowledge of sailing. Aioma was fascinated, and soon they were both on their knees, playing with the model schooner in the pool. The little boat sailed from one end to the other, bowing to the ripples as if it were a real ship on the open sea.\n\nIn that moment, under the sun, the builders of Karolin’s future fleet played like children, their eyes filled with wonder and excitement. The little schooner, a model of the lost Raratonga, sailed gracefully in its miniature sea, a symbol of the vast possibilities that lay ahead.",
    "comments": "Accepted as is.",
    "review_score": 44,
    "rl_reward": 0.808,
    "total_reward": 0.8440000000000001
  },
  {
    "action": "Accept",
    "original": "←\nBook 1\nThe Gates of Morning/Book 1\nby Henry De Vere Stacpoole\nBook 1. Chapter 3\nChapter 2\n→\n​\n\nCHAPTER III\n\nTHE LITTLE SHIPS\n\nT\nHE primitive canoe of the Pacific is a dugout—the trunk of a tree hollowed and shaped into the form of a boat, so narrow in proportion to its length as to be absolutely unstable but for the outrigger.\n\nThe outrigger, a long skate-shaped piece of wood fixed to port—always to port—by poles on a central bridge, is an apology to the sea for want of beam, and the sea accepts it—on conditions. But for the outrigger, no canoe of any size would dare the sea, but for it the islands would have been sealed as between themselves, war made impossible, and the drift of people between island and island and between island and continent.\n\nFar away in the remote past some man once stood, the father of this daring invention; little dreaming of the vast consequences of the work to which he had put his hand.\n\nDick at the steering paddle saw a figure on the northern beach as they drew near. It was Katafa, waiting for him, the wind blowing her girdle of dracæna leaves and her hand sheltering her eyes against the sun. Standing just as Le Moan was standing on the southern beach sheltering her eyes and ​watching the canoe that carried the first man who had ever made her turn her head.\n\nSome children were playing near Katafa and a fishing canoe was putting out near by, but he saw only Katafa.\n\n“Katafa,” said Aioma, who was crouched by the after outrigger pole. “It is she sure enough, and they said she was dead and that her ghost had returned bringing you with her, Taori, but the dead do not return. Katafa, she was the girl under the taboo of Taminan, the girl no man or woman might touch, and then one day she went fishing beyond the reef and a storm took her and she was drowned, so they said.”\n\n“She was not drowned,” replied Dick. “The wind blew her to Marua where I was—I and another whose face I have near forgotten, Kearney, he was called, and he made canoes but not like these, then one day he went among the trees and did not return. Then the god Nan came to the island and after him the men of Karolin who fought together so that all were killed, and then came the bad men as I have told you and would have killed us but we left Marua in the night.... Look, there is the canoe we came in.” He pointed to the dinghy hauled up on the beach.\n\n“O he! Taori!” It was Katafa’s voice hailing them from the shore, glad, sweet, clear as a bell, yet far-carrying as the voice of a gull.\n\nAs Dick sprang out on the sands he seized her in ​his arms; parted only a few hours, it seemed to them that they had been weeks apart.\n\nIn the old days, even before he was born, his mother Emmeline had never been at ease when separated from his father even by the breadth of the lagoon, the demon that hints of mischance seemed always at her ear.\n\nDick seemed to have inherited with his power of love for Katafa, something of the dread of mischance for the beloved.\n\nHe embraced her, heedless of onlookers, though the only eyes to see were the eyes of the children and of Aioma who had eyes for nothing but the dinghy.\n\nAs soon as his foot touched sand, the canoe-builder made for it running like a boy, clapped his hand on the gunnel and then ran it over the planking.\n\nThe boats of the Spanish ship of long ago had been clinker-built and had been destroyed in the fight, but he had seen bits of them washed ashore on the southern beach. The dinghy was carvel-built and entire, a perfect specimen of eastern boat-building over which the canoe designer brooded forgetful of Dick and Katafa, the beach he stood on and the sun that lit it.\n\nThe idea of a boat built of planking and not hollowed out of a tree trunk had been presented to him by the charred and shattered fragments of the Spanish boats, but how to get planking and how to bend it to the form he desired was beyond his imagination and beyond his means. He saw vaguely that these boats ​of the papalagi were made somewhat after the fashion of a man, with a backbone and ribs and a covering for the ribs, he saw that by this means enough beam could be obtained to enable the builder to dispense with the outrigger—but then speed, where was there sign of speed in this thing squat and ugly?\n\nIn the early ages of the world in which Aioma still dwelt, ugliness had only two expressions, the lines that indicated want of speed and the lines that indicated want of strength.\n\nDick, though brown as the canoe-builder and almost to be mistaken for a true islander, was perhaps a million years younger than Aioma, just as the dinghy was a million years younger than the fishing canoe that had just brought him across the lagoon. In Dick, Aioma saw the lines that indicated speed and strength, nothing more—he was blind to the nobility of type expressed by that daring face, to the far sight of the eyes and the breadth of the brow; in the dinghy Aioma saw want of speed—he was blind to the nobility of type that made this bud the sister of a battleship, made it a vertebrate as against the dugout which has neither keel nor ribs.\n\nThen Aioma, standing in the sun, a plain canoe-builder and workman in the sight of God and a critic as every true workman is, began to deride the dinghy, at first with chuckles deep down in his throat, then with a sound like the clacking of a hen, then with laughter long and loud and words of derision.\n\n​“Which end is which of this pig fish?” inquired Aioma of heaven and Dick, “and he who made her, how many more did he make like her?”\n\nDick, who had always connected the dinghy with Kearney, and who had a sort of faith that Kearney had made her just as he had made the little model ships, winced at the laughter of the old man. Perhaps it was the white man in him revolting at the derision of a savage over the works of the white man. However that may be, he turned and ran up the beach to the house of Uta Matu which he and Katafa had made their own. There in the shadow, on a hastily constructed shelf stood the little model ships he had so carefully salved from Palm Tree: the frigate, the schooner, the full-rigged ship and the whale man, the last thread connecting him with civilization; toys of the long ago, but no longer toys—fetiches from a world whose very language he had lost, a world of sun and tall trees where like a ghost in the sun dazzle moved a memory that was once a man—Kearney.\n\nHe took the schooner from its rest and coming out with it, ran to a great pool in the coral, calling Aioma to come and see what he who made the dinghy had also made.\n\nThe pool thirty feet long by twenty broad was ruffled by the breeze from the sea, it was clear as crystal, coral floored—and a trapped school of tiny fish no larger than needles, passed like a silver cloud here and there. Dick on his knees launched the schooner and Aioma standing bent with a hand on each knee ​watched her as she floated on an even keel. Then on the merry west wind with helm properly set and main boom guyed out she went sailing down the pool to the east where Katafa had run to receive her.\n\nAioma watched, then Dick running to the other end showed him how she could sail almost against the wind. Dick knew every stick and string of her, how to hoist and lower main and fore and how to set the head sails,—had you placed him on a real schooner, he could have worked her from his knowledge of the model, and Aioma watched vastly intrigued; then, taking a hand, he got on his knees and the great sun saw the builders of the future fleet of Karolin playing like children, whilst the little schooner on its imitation sea sailed from port to port, bowing to the ripples of the pool as the lost Raratonga, of which it was the model, had bowed to the swell of the great Pacific.\n\nBook 1\nReturn to the top of the page.\nChapter 2",
    "final_text": "### Chapter 3: The Little Ships\n\nThe traditional canoe of the Pacific is a dugout—a tree trunk hollowed out and shaped into a boat. These canoes are narrow and unstable, but they're stabilized by an outrigger. The outrigger is a long, skate-shaped piece of wood attached to the side of the canoe by poles on a central bridge. It's a necessary addition to keep the canoe from tipping over in the sea. Without the outrigger, these canoes wouldn't be seaworthy, and the islands would be isolated, making travel and communication between them nearly impossible.\n\nCenturies ago, someone invented the outrigger, likely never imagining the profound impact it would have on island life. It enabled people to navigate the seas, connecting islands and continents, and even facilitating trade and warfare.\n\nAs Dick steered the canoe towards the northern beach, he spotted a figure waiting for him. It was Katafa, her hair blowing in the wind and her hand shielding her eyes from the sun. She stood just as Le Moan did on the southern beach, watching the canoe approach. Children played nearby, and a fishing canoe was setting out to sea, but Dick's eyes were fixed on Katafa.\n\n“Katafa,” Aioma, crouched by the after outrigger pole, said. “It’s her, just as they said. They thought she was dead and that her ghost had returned with you, Taori. But the dead don’t come back. Katafa was under the taboo of Taminan, untouchable by anyone. Then one day, she went fishing beyond the reef and was swept away by a storm. They said she drowned.”\n\n“She didn’t drown,” Dick replied. “The wind blew her to Marua, where I was. I was with Kearney, who built canoes differently. One day, he went into the forest and never returned. Then the god Nan came to the island, followed by the Karolin men who fought and were all killed. After that, bad men arrived and would have killed us, but we escaped Marua in the night. Look, there’s the dinghy we came in.”\n\nDick pointed to the small boat hauled up on the beach. As soon as his feet touched the sand, he ran to Katafa and embraced her. They had been apart for only a few hours, but it felt like weeks.\n\nDick’s mother, Emmeline, had always been anxious when separated from his father, even by the width of a lagoon. Dick seemed to inherit that anxiety, feeling a deep dread of anything that might harm Katafa.\n\nAioma, the canoe-builder, immediately headed towards the dinghy, running like a boy. He ran his hand over the planking, marveling at the craftsmanship. The dinghy was carvel-built, with planks laid edge to edge, unlike the clinker-built boats of the Spanish ship that had been destroyed in a fight. The dinghy was a perfect example of eastern boat-building, and Aioma was captivated by it, forgetting everything else around him.\n\nThe idea of a boat built from planks rather than a hollowed-out tree trunk had been sparked by the remnants of the Spanish boats. However, Aioma couldn’t figure out how to get the planks or bend them into the shape he wanted. He saw that these boats had a backbone and ribs, covered by planks, which gave them enough stability to do without an outrigger. But he wondered about speed—these boats seemed slow and clumsy.\n\nAioma, standing in the sun, began to mock the dinghy. He chuckled at first, then laughed loudly, deriding its design. “Which end is which on this pig fish?” he joked. “And how many more like it did the maker build?”\n\nDick, who had always associated the dinghy with Kearney, felt a pang of anger at Aioma’s laughter. Perhaps it was the white man in him, revolting against the ridicule of a “savage” over the work of a white man. He turned and ran up the beach to the house he shared with Katafa. There, on a hastily built shelf, stood the little model ships he had rescued from Palm Tree: a frigate, a schooner, a full-rigged ship, and a whaler. These models were his last connection to civilization, toys from a distant past that now held a deeper significance.\n\nHe took the schooner model and ran to a large pool in the coral. The pool was clear and filled with tiny fish darting about. Dick launched the schooner, and Aioma watched as it floated smoothly. Dick demonstrated how the model could sail almost against the wind, showing off his deep knowledge of sailing. Aioma was fascinated, and soon they were both on their knees, playing with the model schooner in the pool. The little boat sailed from one end to the other, bowing to the ripples as if it were a real ship on the open sea.\n\nIn that moment, under the sun, the builders of Karolin’s future fleet played like children, their eyes filled with wonder and excitement. The little schooner, a model of the lost Raratonga, sailed gracefully in its miniature sea, a symbol of the vast possibilities that lay ahead.",
    "comments": "Accepted as is.",
    "review_score": 44,
    "rl_reward": 0.808,
    "total_reward": 0.8440000000000001
  },
  {
    "action": "Edit",
    "original": "←\nChapter 4\nThe Gates of Morning\nby Henry De Vere Stacpoole\nBook 1. Chapter 5\nChapter 6\n→\n​\n\nCHAPTER V\n\nCIVILIZATION PEEPS IN\n\nW\nITHOUT looking back, she turned the nose of her canoe straight for the southern beach. To left of her as she paddled lay the sea gate where the tide was flooding round the coral and the breeze blowing the gulls like snowflakes against the blue; to right the limitless expanse of the lagoon; ahead the desolate beach, the ruined village and the wild tangle of pandanus trees, their limbs wide-spreading as the limbs of an elm, their fronds tossing like ill-kempt hair.\n\nShe hauled the light canoe above tide mark, then, turning to the right along the sands, she passed the trees and climbed the coral, standing for a moment facing the south and the empty sea. Then, turning, she gazed across the lagoon to where the far-away northern beach showed its trees above the water dazzle.\n\nIt was near full flood and the lagoon was brimming, the outer sea coming in great sheets of smoky blue, whirls of amethyst and streaks of cobalt between the piers of the break. Le Moan could hear the suck of the water through the gates as distinct from the sound of the breakers on the coral, beyond the sound of the breakers the voices of the gulls, beyond the gulls the ​silence reaching to the white trade clouds on the rim of the purple sea.\n\nShe was alone, but for the matter of that, she had always been alone, Aioma and the two old men and the women and children who formed the last remnant of the southern tribe had never been her companions; she had fished with them and helped in the cooking and mat-making, talked with them, lived with them, yet in a way, dwelt apart.\n\nIt was the race difference, perhaps, or some bent of soul owing to the fusion of races in her that made her a being quite alone, relying on no one but herself—a creature apart, almost a spirit. She had the power to lose herself utterly when gazing down into clear water as on the day when Dick first saw her gazing into the pond by the trees. Great distances held her in the same way should she give herself over to them, and that strange flair for direction which she shared with the gulls was less perhaps instinctive than psychic, for the mind of Le Moan, eternally in touch with the wind, the sea, the sun and the stars, was clairvoyant to the coming of storm and the sea changes that brought the great tiger sharks into the lagoon, altered the course of the mullet or drove the palu far from the fishing banks to northward of the reef.\n\nHaving stood for a while gazing to the north, she came back towards the deserted houses and began to prepare herself some food; after that there were lines to be mended and oap to be cleared from the paraka ​patch and then came sunset and then the stars, and sleep deeper than the great depths beyond the palu bank.\n\nHad Le Moan looked back across her past, she would have seen a succession of days coloured like the day just dead, brilliancy stretching away into years and opalled by rainy seasons and storms, nights when dreams were unhaunted by human form till to-night, when, towards dawn, a ghostly canoe man showed in the mirror of sleep paddling towards her across a shimmering lagoon.\n\nThen as the dream broke up and the vision vanished, Le Moan awoke beneath the last of the stars, awoke suddenly with fear clutching at her heart and with eyes wide but still half-blinded with sleep.\n\nShe sat up. The dawn was breaking and the fishing gulls were putting out to sea; she could hear their voices through the sound of the breakers on the reef. Nothing more, yet she listened, listened with her eyes fixed on the great fan of light showing in the eastern sky against which the gulls showed like withered leaves tossed on the wind.\n\nNothing. The sea breeze stirred the leaves of the breadfruit and the branches of the pandamus palms and then fell flat, died out and changed to the first stirring of a land breeze, the highest flying gulls took colour and the ghostly lagoon took form.\n\nThe girl rising to her feet swept the lagoon water with her eyes. Nothing. Then, turning, she passed ​between the trees to the coral of the outer beach and there, out on the ghostly sea and touched by the light of dawn, she saw a ship.\n\nYears after the destruction of the Spanish ship, which had happened before her birth, a whale man had put into the lagoon, cut wood, taken on water, been attacked by Uta Matu, the chief of Karolin, and escaped to the outer sea by a miracle.\n\nUta would have sent her to the bottom of the lagoon after the Spaniard, for in the depth of his ignorant but instinctive heart lay the knowledge that the black man’s burden is the white man and that civilization to the savage means death.\n\nLe Moan could still see as in a glass darkly the fight and the escape of the whale man, and here again was a ship, different in shape from the one of long ago, but arousing in her mind, from association, an instinct of antagonism and dread.\n\nThe ship, which had been standing off and on all night, was a schooner, and now as the great sun heaved himself higher and golden ripples broke the sea line, Le Moan watched her take fire, sail after sail catching the light till on the newborn blue of the sea a golden ship lay heaving to the swell, flown round by golden gulls, whose voices came chanting against the breeze like the voices of ghostly sailormen hauling in chorus.\n\nThen as she altered her helm and the wind shivered out of her canvas, a boat was dropped, it ran up a sail and Le Moan, her eyes shaded against the risen ​sun, saw the boat heading for the break. She ran back amongst the trees and stood for a moment, her hand pressed against her forehead, her mind in confusion, with one idea only fixed and steadfast—Taori.\n\nHere was danger, recollection backed instinct, the powerful instinct of a mind that could tell the north from the south without star or compass, the coming changes of weather, the movement of the fish shoals—the instinct that had awakened her with fear clutching at her heart.\n\nHere was danger to Taori, and now as she stood her hand clasped on her forehead, came the recollection, not only of Uta Matu’s fight against the whale man, but of Taori’s words to Aioma about the bad men on Marua and the necessity of building the war canoes and of how the young men of Karolin would soon be ripe for war.\n\nBut the canoes were not built and the warriors were not ready, and here, suddenly from out of nowhere, had come this great canoe with sails spreading to the sky. Uta Matu and his warriors and fleet were vanished and Taori was unprepared. Then came the thought that the boat making for the break was like the pilot fish that scouts ahead of the tiger shark, it would come into the lagoon and if it found food worth devouring, the tiger shark would follow.\n\nThe village on the northern beach was invisible from the break, owing to the trees and the crafty way Uta Matu had set it amongst the trees. She remembered that.\n\n​Then her heart suddenly took flame. She would save Taori.\n\nShe left the trees and, taking the sand of the inner beach, she began running towards the break. She would attract the boat to her.\n\nYou have seen a bird attracting a man away from its nest, heedless of its own fate, thinking only of the thing it loved; just so Le Moan, facing the unknown, which was more terrible than the terrible, sought now to save the being she loved with the love that casts out fear.\n\nShe had not run a hundred yards when the boat entered the lagoon, heeling to the breeze and carried by the first of the flood, she flung up her arms to it, then she stood watching as it changed its course making straight towards her.\n\nIt was an ordinary ship’s quarter boat, painted white, fitted with a mast and lug sail, and Le Moan as she stood watching paralysed and waiting for her fate, saw that she held four men, three kanakas, whose naked shoulders showed above the gunnel, and a huge man, black bearded and wearing a broad-brimmed white straw hat beneath which his face showed dark and terrible as the face of the King of Terrors.\n\nHe wore a shirt open at the throat and his shirt sleeves were rolled up showing arms white yet covered with black hair. As the boat grounded and the kanakas sprang out Le Moan scarcely saw them; her eyes were fixed on the great man now standing on the beach, Colin Peterson, no less, one of the last ​of the sandalwood traders, master and owner of the Kermadec—Black Peterson, terrible to look at, swift to strike when roused, yet a man with kindness in his heart and straightness in his soul.\n\nPoor Le Moan, had she only known!\n\nPeterson, sweeping his eyes over the empty and ruined houses and the desolate beach, fixed them on the girl, spoke to her in a tongue she did not understand and then called out\n\n“Sru!”\n\nA kanaka stepped forward. He was a Paumotuan, a yellow man, and half Malanesian, fierce of face, frizzy headed and wearing a necklace of little shells. After a word with Peterson, he turned to Le Moan and spoke to her and she understood. The language of Karolin was the language of the Paumotas; those far-off islands in the distant days had raided and fought with Karolin, in days still further removed the first inhabitants of Karolin had drifted from the Paumotas but neither Le Moan nor Sru knew aught of this nor of the common ancestry which gave them power of speech.\n\n“I am here alone,” said Le Moan answering Sru. “My people are gone—a storm took them all. There is no one here.” As she spoke her eyes left Sru and wandered northward to the far trace of the northern beach, the dread at her heart was lest Taori might, by some ill-chance, put out fishing, show himself and be lost, but nothing appeared, nothing but the far-distant trees above the sun blaze on the water.\n\n​She knew that the schooner was too far off and too much sheltered by the southern reef for the people on the north beach to see her, that Taori would be busy with the canoe building, yet the dread at her heart drove her to repeat the words automatically like a parrot. “There is no one here but me—my people are gone; a storm took them—I am here alone.” As she spoke, she watched Peterson with side glances. She had never seen a bearded man before, and this man with the black curling hair reaching almost to his eyes seemed a monster.\n\nWhilst she was speaking, the other kanakas taking two large water breakers from the boat began to fill them at the well, the well into which she had been looking on the day on which she had first seen Taori.\n\nColin Peterson stood looking at them, he had half turned from Le Moan and seemed to have forgotten her existence; then, shading his eyes, he looked across and about the lagoon, but he was thinking neither of the kanakas nor the lagoon. He was cursing Le Moan.\n\nHe had no use for this girl. He had come ashore for water at this uncharted island thinking maybe to find natives, never dreaming that he would be faced by a problem like this. It was impossible to leave the forlorn creature to her fate, yet what was he to do with her on board of the Kermadec? Had it been a man or a boy the matter would have been simple enough, but a girl? If he took her off he would have to find her a home somewhere among the kanakas ​on one of the northern islands. He was bound for Amao but he reckoned that place was of no use—the kanakas were a bad lot.\n\nAs he stood like this thinking and staring about her, Le Moan still watched him, this terrific man who seemed searching with his eyes for Taori.\n\nWould he believe her story—would he kill her? Old tales of the terrible papalagi chased through her mind like bats in the dusk that had fallen upon her powers of thought—she did not know. She only knew that she did not care whether he killed her or not as long as he believed her story and departed without hurting Taori.\n\nThen, suddenly, the last breaker of water in the boat, Peterson turned on Sru and shouted to him to fetch her on board. Perplexity in Peterson generally expressed itself in blasphemy, and when Big Feller Mass’r Peterson began to talk like that, Sru never waited for the toe of the boot that was sure to follow.\n\nHe seized Le Moan by the arm and pushed her to the boat; for a moment she resisted, then she gave up, tumbled in and squatting forward of the mast saw as one sees in a dream the straining shoulders and tense arms of the kanakas, as, bending and clutching the port and starboard gunnels, they ran the boat out; she saw them tumble on board, felt the grating of the sand and then the balloon-like lift of the waterborne keel; she saw the sail above her take the wind and bulge hard against the blue of the sky; she saw the flying gulls and the wheeling lagoon and the trees ​of the southern beach vanishing to starboard as the boat headed for the break, but always and above everything she saw the massive hand of Peterson as he sat in the stern sheets with the tiller in the crook of his elbow and his eyes fixed towards her and beyond.\n\n\nAi, the sea! What tragedies has it not been partner in? The sea of storms, the blue laughing sea, the sea that now, lovely in the light of morning was flooding gently with the first of the flood through the gates of Karolin, lifting the boat to the outer swell as it passed the coral piers where the gulls cried above the foam of the breakers and the breakers answered to the crying gulls.\n\nIf Peterson had killed Le Moan on the beach, she would have met her death without flinching. Seated now watching Karolin drop astern, her eyes never wavered nor softened—even her fear of Peterson had vanished. It was as though she had died on passing the gates of the great atoll and entered a land where personality was not, only perception. A land of pictures that had no relationship to herself or anything she had ever known. She saw as they came alongside the white painted side of the Kermadec with the ladder cast down, the rail, and above the rail the great white sail spaces all a-shiver in the wind. The faces of men looking down at the boat, the face of Rantan the mate, and Carlin, a beachcomber picked up at Soma and working his passage north.\n\n​Then she was on the deck, which seemed to her broad and white as a beach, and the extraordinary newness of this strange place took on a cutting edge which pierced the deadness that had fallen upon her—this place so vast to her mind that it seemed land of a sort. A moment before, in the boat, the sea had been around her, but here the sea was nothing, this place was everything. Taori, Karolin, the reef, the ocean itself, all for a moment vanished, consumed by the Kermadec as by a flame.\n\nAnd not a soul took notice of her after the first few words of Peterson to the Mate. They were busy getting in the boat and now as the rumbling and threshing of the canvas above died out and the sails filled hard against the blue came the voices of gulls, gulls from the reef and deep-sea gulls flitting in the wake of the Kermadec that was now under way.\n\nLe Moan, feeling herself unnoticed, and moving cautiously, came to the weather rail. She saw the reef and the distant trees of Karolin and the following gulls now flying north and south as if giving up the chase. Then the reef line passed from sight beneath the sea dazzle and the voice of the reef and the crying of the gulls died far off, whilst the tree-tops vainly fought with the ever-growing distance, now clinging to the sight, now washed utterly away.\n\nChapter 4\nReturn to the top of the page.\nChapter 6",
    "final_text": "### Chapter 5: The Arrival of the Unknown\n\n",
    "comments": "Human edited.",
    "review_score": 44,
    "rl_reward": 0.81,
    "total_reward": 0.845
  }
]